### 10.1 SQLite数据库简介

### 10.2 Python读写SQLite

In [8]:
#连接SQLite数据库，在数据库中建立一张表Employee，并向表中插入4条数据
import sqlite3 as lite
conn= lite.connect("d:/test.sqlite")
cur=conn.cursor()
cur.execute("DROP TABLE IF EXISTS Employee")
cur.execute("CREATE TABLE Employee(ID CHAR(5) PRIMARY KEY NOT NULL,NAME TEXT,AGE INT,GENDER BIT,SALARY REAL)")
cur.execute("INSERT INTO Employee VALUES ('00123','ALEX',28,1,16000)")
cur.execute("INSERT INTO Employee VALUES ('00124','ED',33,1,8000)")
cur.execute("INSERT INTO Employee VALUES ('00011','JENNY',45,0,16000)")
cur.execute("INSERT INTO Employee VALUES ('00019','ANNA',35,0,11000)")
conn.commit()
cur.close()
conn.close()

In [9]:
#读取Employee中所有记录，并返回数据集中的第一行数据
conn = lite.connect("d:/test.sqlite")
cur=conn.cursor()
cur.execute("SELECT * FROM Employee")
data=cur.fetchone()
data

('00123', 'ALEX', 28, 1, 16000.0)

In [10]:
data=cur.fetchall()
conn.close()
data

[('00124', 'ED', 33, 1, 8000.0),
 ('00011', 'JENNY', 45, 0, 16000.0),
 ('00019', 'ANNA', 35, 0, 11000.0)]

### 10.3 Pandas读写SQLite

In [11]:
#dataframe数据写入test数据库的 pd_Employee表中
import pandas as pd
employee=[{'ID':'00123','NAME':'ALEX','AGE':28,'GENDER':1,'SALARY':16000},{'ID':'00124','NAME':'ED','AGE':33,'GENDER':1,'SALARY':8000},
          {'ID':'00011','NAME':'JENNY','AGE':45,'GENDER':0,'SALARY':16000},{'ID':'00019','NAME':'ANNA','AGE':35,'GENDER':0,'SALARY':11000}]
df=pd.DataFrame(employee)
conn = lite.connect("d:/test.sqlite")
df.to_sql(name='pd_Employee',con=conn,if_exists='replace',index=False)
conn.close()

In [12]:
#sql查询
conn = lite.connect("d:/test.sqlite")
df=pd.read_sql("SELECT * FROM pd_Employee ORDER BY SALARY DESC",con=conn)
df1=pd.read_sql("SELECT * FROM pd_Employee ORDER BY SALARY",con=conn)
df2=pd.read_sql("SELECT * FROM pd_Employee WHERE GENDER=1",con=conn)
df3=pd.read_sql("SELECT GENDER,AVG(SALARY) AS AVG_SALARY FROM pd_Employee GROUP BY GENDER",con=conn)
df3

   GENDER  AVG_SALARY
0       0     13500.0
1       1     12000.0